# LFillFore

## Description
Procedure LFillFore sets the foreground fill color for the active layer. RGB values are in the range of 0~65535.

```pascal
PROCEDURE LFillFore(color : LONGINT);
```

```python

def vs.LFillFore(color):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|color|LONGINT|RGB color component value.|

## Remarks
Sets the foreground fill color for the active layer.<BR>
<BR>
[sd 8/14/98]<BR>

## Examples
```pascal
LFillFore(65535,0,39321);

```

## Version
Availability: from MiniCAD
## Category
* Layers